RT-Thread/rt-thread/components/drivers/usb/cherryusb/port/nrf5x/usb_dc_nrf5x.c
  /*!< Clear stall and reset DataToggle */
  NRF_USBD->EPSTALL = (USBD_EPSTALL_STALL_UnStall << USBD_EPSTALL_STALL_Pos) | (ep_cfg->bEndpointAddress);
  NRF_USBD->DTOGGLE = (USBD_DTOGGLE_VALUE_Data0 << USBD_DTOGGLE_VALUE_Pos) | (ep_cfg->bEndpointAddress);

  __ISB();
  __DSB();

  return 0;
}

/**@brief Usbds the ep close.
 *
 * @param[in] busid do not used
 * @param[in] ep    ep ： Endpoint address
 *
 * @retval >=0 success otherwise failureClose endpointNone
 */
int usbd_ep_close(uint8_t busid, const uint8_t ep)
{
  /*!< ep id */
  uint8_t epid = USB_EP_GET_IDX(ep);
  if (epid != EP_ISO_NUM)
  {

    if (USB_EP_DIR_IS_OUT(ep))
    {
      usb_dc_cfg.ep_out[epid].ep_enable = false;
      NRF_USBD->INTENCLR = (1 << (USBD_INTEN_ENDEPOUT0_Pos + epid));
      NRF_USBD->EPOUTEN &= ~(1 << (epid));
    }
    else
    {
      usb_dc_cfg.ep_in[epid].ep_enable = false;
      NRF_USBD->INTENCLR = (1 << (USBD_INTEN_ENDEPIN0_Pos + epid));
      NRF_USBD->EPINEN &= ~(1 << (epid));
    }
  }
  else
  {
    /*!< ISO EP */
    if (USB_EP_DIR_IS_OUT(ep))
    {
      usb_dc_cfg.ep_out[epid].ep_enable = false;
      usb_dc_cfg.ep_out[EP_ISO_NUM].mps = 0;
      NRF_USBD->INTENCLR = USBD_INTENCLR_ENDISOOUT_Msk;
      NRF_USBD->EPOUTEN &= ~USBD_EPOUTEN_ISOOUT_Msk;
      NRF_USBD->EVENTS_ENDISOOUT = 0;
    }
    else
    {
      usb_dc_cfg.ep_in[epid].ep_enable = false;
      usb_dc_cfg.ep_in[EP_ISO_NUM].mps = 0;
      NRF_USBD->INTENCLR = USBD_INTENCLR_ENDISOIN_Msk;
      NRF_USBD->EPINEN &= ~USBD_EPINEN_ISOIN_Msk;
    }
    /*!< One of the ISO endpoints closed, no need to split buffers any more. */
    NRF_USBD->ISOSPLIT = USBD_ISOSPLIT_SPLIT_OneDir;
    /*!< When both ISO endpoint are close there is no need for SOF any more. */
    if (usb_dc_cfg.ep_in[EP_ISO_NUM].mps + usb_dc_cfg.ep_out[EP_ISO_NUM].mps == 0)
    {
      NRF_USBD->INTENCLR = USBD_INTENCLR_SOF_Msk;
    }
  }
  __ISB();
  __DSB();

  return 0;
}

/**
 * @brief Setup in ep transfer setting and start transfer.
 *
 * This function is asynchronous.
 * This function is similar to uart with tx dma.
 *
 * This function is called to write data to the specified endpoint. The
 * supplied usbd_endpoint_callback function will be called when data is transmitted
 * out.
 *
 * @param[in]  busid     do not used
 * @param[in]  ep        Endpoint address corresponding to the one
 *                       listed in the device configuration table
 * @param[in]  data      Pointer to data to write
 * @param[in]  data_len  Length of the data requested to write. This may
 *                       be zero for a zero length status packet.
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_start_write(uint8_t busid, const uint8_t ep, const uint8_t *data, uint32_t data_len)
{
  uint8_t ep_idx = USB_EP_GET_IDX(ep);

  if (!data && data_len)
  {
    return -1;
  }
  if (!usb_dc_cfg.ep_in[ep_idx].ep_enable)
  {
    return -2;
  }
  if ((uint32_t)data & 0x03)
  {
    return -3;
  }

  usb_dc_cfg.ep_in[ep_idx].xfer_buf = (uint8_t *)data;
  usb_dc_cfg.ep_in[ep_idx].xfer_len = data_len;
  usb_dc_cfg.ep_in[ep_idx].actual_xfer_len = 0;

  if (data_len == 0)
  {
    /*!< write 0 len data */
    nrf_usbd_ep_easydma_set_tx(ep_idx, (uint32_t)NULL, 0);
    NRF_USBD->TASKS_STARTEPIN[ep_idx] = 1;
  }
  else
  {
    /*!< Not zlp */
    data_len = MIN(data_len, usb_dc_cfg.ep_in[ep_idx].mps);
    if (!CHECK_ADD_IS_RAM(data))
    {
      /*!< Data is not in ram */
      /*!< Memcpy data to ram */
      memcpy(usb_dc_cfg.ep_in[ep_idx].ep_buffer, data, data_len);
      nrf_usbd_ep_easydma_set_tx(ep_idx, (uint32_t)usb_dc_cfg.ep_in[ep_idx].ep_buffer, data_len);
    }
    else
    {
      nrf_usbd_ep_easydma_set_tx(ep_idx, (uint32_t)data, data_len);
    }
    /**
     * Note that starting DMA transmission is to transmit data to USB peripherals,
     * and then wait for the host to get it
     */
    /*!< Start dma transfer */
    if (ep_idx != EP_ISO_NUM)
    {
      NRF_USBD->TASKS_STARTEPIN[ep_idx] = 1;
    }
    else
    {
      // NRF_USBD->TASKS_STARTISOIN = 1;
      usb_dc_cfg.iso_tx_is_ready = 1;
    }
  }
  return 0;
}

/**
 * @brief Setup out ep transfer setting and start transfer.
 *
 * This function is asynchronous.
 * This function is similar to uart with rx dma.
 *
 * This function is called to read data to the specified endpoint. The
 * supplied usbd_endpoint_callback function will be called when data is received
 * in.
 *
 * @param[in]  busid     do not used
 * @param[in]  ep        Endpoint address corresponding to the one
 *                       listed in the device configuration table
 * @param[in]  data      Pointer to data to read
 * @param[in]  data_len  Max length of the data requested to read.
 *
 * @return 0 on success, negative errno code on fail.
 */
int     usbd_ep_start_read(uint8_t busid, const uint8_t ep, uint8_t *data, uint32_t data_len)
{
  uint8_t ep_idx = USB_EP_GET_IDX(ep);

  if (!data && data_len)
  {
    return -1;
  }
  if (!usb_dc_cfg.ep_out[ep_idx].ep_enable)
  {
    return -2;
  }
  if ((uint32_t)data & 0x03)
  {
    return -3;
  }

  usb_dc_cfg.ep_out[ep_idx].xfer_buf = (uint8_t *)data;
  usb_dc_cfg.ep_out[ep_idx].xfer_len = data_len;
  usb_dc_cfg.ep_out[ep_idx].actual_xfer_len = 0;

  if (data_len == 0)
  {
    return 0;
  }
  else
  {
    data_len = MIN(data_len, usb_dc_cfg.ep_out[ep_idx].mps);
    if (!CHECK_ADD_IS_RAM(data))
    {
      /*!< Data address is not in ram */
      // TODO:
    }
    else
    {
      if (ep_idx == 0)
      {
        NRF_USBD->TASKS_EP0RCVOUT = 1;
      }
      nrf_usbd_ep_easydma_set_rx(ep_idx, (uint32_t)data, data_len);
    }
  }
  return 0;
}

/**
 * @brief            Endpoint setting pause
 * @pre              None
 * @param[in]        busid     do not used
 * @param[in]        ep ： Endpoint address
 * @retval           >=0 success otherwise failure
 */
int usbd_ep_set_stall(uint8_t busid, const uint8_t ep)
{
  /*!< ep id */
  uint8_t epid = USB_EP_GET_IDX(ep);
  if (epid == 0)
  {
    NRF_USBD->TASKS_EP0STALL = 1;
  }
  else if (epid != EP_ISO_NUM)
  {
    NRF_USBD->EPSTALL = (USBD_EPSTALL_STALL_Stall << USBD_EPSTALL_STALL_Pos) | (ep);
  }
  __ISB();
  __DSB();
  return 0;
}

/**
 * @brief            Endpoint clear pause
 * @pre              None
 * @param[in]        busid     do not used
 * @param[in]        ep ： Endpoint address
 * @retval           >=0 success otherwise failure
 */
int usbd_ep_clear_stall(uint8_t usbid, const uint8_t ep)
{
  /*!< ep id */
  uint8_t epid = USB_EP_GET_IDX(ep);

  if (epid != 0 && epid != EP_ISO_NUM)
  {
    /**
     * reset data toggle to DATA0
     * First write this register with VALUE=Nop to select the endpoint, then either read it to get the status from
     * VALUE, or write it again with VALUE=Data0 or Data1
     */
    NRF_USBD->DTOGGLE = ep;
    NRF_USBD->DTOGGLE = (USBD_DTOGGLE_VALUE_Data0 << USBD_DTOGGLE_VALUE_Pos) | ep;

    /*!< Clear stall */
    NRF_USBD->EPSTALL = (USBD_EPSTALL_STALL_UnStall << USBD_EPSTALL_STALL_Pos) | ep;

    /*!< Write any value to SIZE register will allow nRF to ACK/accept data */
    if (USB_EP_DIR_IS_OUT(ep))
      NRF_USBD->SIZE.EPOUT[epid] = 0;

    __ISB();
    __DSB();
  }

