RT-Thread/rt-thread/components/drivers/usb/cherryusb/port/nrf5x/usb_dc_nrf5x.c
  /*!< bit 20 */
  if (int_status & USBD_INTEN_ENDISOOUT_Msk)
  {
    if (usb_dc_cfg.ep_out[EP_ISO_NUM].is_using_dma == 1)
    {
      usb_dc_cfg.ep_out[EP_ISO_NUM].is_using_dma = 0;
      uint32_t read_count = NRF_USBD->SIZE.ISOOUT;
      usb_dc_cfg.ep_out[EP_ISO_NUM].xfer_buf += read_count;
      usb_dc_cfg.ep_out[EP_ISO_NUM].actual_xfer_len += read_count;
      usb_dc_cfg.ep_out[EP_ISO_NUM].xfer_len -= read_count;

      if ((read_count < usb_dc_cfg.ep_out[EP_ISO_NUM].mps) || (usb_dc_cfg.ep_out[EP_ISO_NUM].xfer_len == 0))
      {
        usbd_event_ep_out_complete_handler(0, ((EP_ISO_NUM)&0x7f), usb_dc_cfg.ep_out[EP_ISO_NUM].actual_xfer_len);
      }
      else
      {
        if (usb_dc_cfg.ep_out[EP_ISO_NUM].xfer_len > usb_dc_cfg.ep_out[EP_ISO_NUM].mps)
        {
          nrf_usbd_ep_easydma_set_rx(((EP_ISO_NUM)&0x7f), (uint32_t)usb_dc_cfg.ep_out[EP_ISO_NUM].xfer_buf, usb_dc_cfg.ep_out[EP_ISO_NUM].mps);
        }
        else
        {
          nrf_usbd_ep_easydma_set_rx(((EP_ISO_NUM)&0x7f), (uint32_t)usb_dc_cfg.ep_out[EP_ISO_NUM].xfer_buf, usb_dc_cfg.ep_out[EP_ISO_NUM].xfer_len);
        }
      }
    }
  }

  /**
   * Traverse ordinary out endpoint events, starting from endpoint 1 to endpoint 7,
   * and end 0 for special processing
   */
  for (uint8_t offset = 0; offset < 7; offset++)
  {
    if (int_status & (USBD_INTEN_ENDEPOUT1_Msk << offset))
    {
      /*!< Out 'offset' transfer complete */
      uint32_t read_count = NRF_USBD->SIZE.EPOUT[offset + 1];
      usb_dc_cfg.ep_out[offset + 1].xfer_buf += read_count;
      usb_dc_cfg.ep_out[offset + 1].actual_xfer_len += read_count;
      usb_dc_cfg.ep_out[offset + 1].xfer_len -= read_count;

      if ((read_count < usb_dc_cfg.ep_out[offset + 1].mps) || (usb_dc_cfg.ep_out[offset + 1].xfer_len == 0))
      {
        usbd_event_ep_out_complete_handler(0, ((offset + 1) & 0x7f), usb_dc_cfg.ep_out[offset + 1].actual_xfer_len);
      }
      else
      {
        if (usb_dc_cfg.ep_out[offset + 1].xfer_len > usb_dc_cfg.ep_out[offset + 1].mps)
        {
          nrf_usbd_ep_easydma_set_rx(((offset + 1) & 0x7f), (uint32_t)usb_dc_cfg.ep_out[offset + 1].xfer_buf, usb_dc_cfg.ep_out[offset + 1].mps);
        }
        else
        {
          nrf_usbd_ep_easydma_set_rx(((offset + 1) & 0x7f), (uint32_t)usb_dc_cfg.ep_out[offset + 1].xfer_buf, usb_dc_cfg.ep_out[offset + 1].xfer_len);
        }
      }
    }
  }

  /*!< bit 12 */
  if (int_status & USBD_INTEN_ENDEPOUT0_Msk)
  {
    uint32_t read_count = NRF_USBD->SIZE.EPOUT[0];
    usb_dc_cfg.ep_out[0].actual_xfer_len += read_count;
    usb_dc_cfg.ep_out[0].xfer_len -= read_count;

    if (usb_dc_cfg.ep_out[0].xfer_len == 0)
    {
      /*!< Enable the state phase of endpoint 0 */
      NRF_USBD->TASKS_EP0STATUS = 1;
    }

    usbd_event_ep_out_complete_handler(0, 0x00, usb_dc_cfg.ep_out[0].actual_xfer_len);
  }

  /*!< bit 11 */
  if (int_status & USBD_INTEN_ENDISOIN_Msk)
  {
  }

  /*!< bit 10 */
  if (int_status & USBD_INTEN_EP0DATADONE_Msk)
  {
    switch (usb_dc_cfg.setup.bmRequestType >> USB_REQUEST_DIR_SHIFT)
    {
    case 1:
      /*!< IN */
      if (usb_dc_cfg.ep_in[0].xfer_len > usb_dc_cfg.ep_in[0].mps)
      {
        usb_dc_cfg.ep_in[0].xfer_len -= usb_dc_cfg.ep_in[0].mps;
        usb_dc_cfg.ep_in[0].actual_xfer_len += usb_dc_cfg.ep_in[0].mps;
        usbd_event_ep_in_complete_handler(0, 0 | 0x80, usb_dc_cfg.ep_in[0].actual_xfer_len);
      }
      else
      {
        usb_dc_cfg.ep_in[0].actual_xfer_len += usb_dc_cfg.ep_in[0].xfer_len;
        usb_dc_cfg.ep_in[0].xfer_len = 0;
        /*!< Enable the state phase of endpoint 0 */
        usbd_event_ep_in_complete_handler(0, 0 | 0x80, usb_dc_cfg.ep_in[0].actual_xfer_len);
        NRF_USBD->TASKS_EP0STATUS = 1;
      }
      break;
    case 0:
      if (usb_dc_cfg.setup.bRequest != USB_REQUEST_SET_ADDRESS)
      {
        /*!< The data arrives at the usb fifo, starts the dma transmission, and transfers it to the user ram  */
        NRF_USBD->TASKS_STARTEPOUT[0] = 1;
      }
      break;
    }
  }

  /**
   * Traversing ordinary in endpoint events, starting from endpoint 1 to endpoint 7,
   * endpoint 0 special processing
   */
  for (uint8_t offset = 0; offset < 7; offset++)
  {
    if (int_status & (USBD_INTEN_ENDEPIN1_Msk << offset))
    {
      /*!< DMA move data completed */
    }
  }

  /*!< bit 1 */
  if (int_status & USBD_INTEN_STARTED_Msk)
  {
    /*!< Easy dma start transfer data */
  }

  /*!< bit 2 */
  if (int_status & USBD_INTEN_ENDEPIN0_Msk)
  {
    /*!< EP0 IN DMA move data completed */
  }

  /*!< bit 0 */
  if (int_status & USBD_INTEN_USBRESET_Msk)
  {
    NRF_USBD->EPOUTEN = 1UL;
    NRF_USBD->EPINEN = 1UL;

    for (int i = 0; i < 8; i++)
    {
      NRF_USBD->TASKS_STARTEPIN[i] = 0;
      NRF_USBD->TASKS_STARTEPOUT[i] = 0;
    }

    NRF_USBD->TASKS_STARTISOIN = 0;
    NRF_USBD->TASKS_STARTISOOUT = 0;

    /*!< Clear USB Event Interrupt */
    NRF_USBD->EVENTS_USBEVENT = 0;
    NRF_USBD->EVENTCAUSE |= NRF_USBD->EVENTCAUSE;

    /*!< Reset interrupt */
    NRF_USBD->INTENCLR = NRF_USBD->INTEN;
    NRF_USBD->INTENSET = USBD_INTEN_USBRESET_Msk | USBD_INTEN_USBEVENT_Msk | USBD_INTEN_EPDATA_Msk |
                         USBD_INTEN_EP0SETUP_Msk | USBD_INTEN_EP0DATADONE_Msk | USBD_INTEN_ENDEPIN0_Msk | USBD_INTEN_ENDEPOUT0_Msk | USBD_INTEN_STARTED_Msk;

    usbd_event_reset_handler(0);
  }
}

/**
 * Errata: USB cannot be enabled.
 */
static bool chyu_nrf52_errata_187(void)
{
#ifndef NRF52_SERIES
  return false;
#else
#if defined(NRF52820_XXAA) || defined(DEVELOP_IN_NRF52820) || defined(NRF52833_XXAA) || defined(DEVELOP_IN_NRF52833) || defined(NRF52840_XXAA) || defined(DEVELOP_IN_NRF52840)
  uint32_t var1 = *(uint32_t *)0x10000130ul;
  uint32_t var2 = *(uint32_t *)0x10000134ul;
#endif
#if defined(NRF52840_XXAA) || defined(DEVELOP_IN_NRF52840)
  if (var1 == 0x08)
  {
    switch (var2)
    {
    case 0x00ul:
      return false;
    case 0x01ul:
      return true;
    case 0x02ul:
      return true;
    case 0x03ul:
      return true;
    default:
      return true;
    }
  }
#endif
#if defined(NRF52833_XXAA) || defined(DEVELOP_IN_NRF52833)
  if (var1 == 0x0D)
  {
    switch (var2)
    {
    case 0x00ul:
      return true;
    case 0x01ul:
      return true;
    default:
      return true;
    }
  }
#endif
#if defined(NRF52820_XXAA) || defined(DEVELOP_IN_NRF52820)
  if (var1 == 0x10)
  {
    switch (var2)
    {
    case 0x00ul:
      return true;
    case 0x01ul:
      return true;
    case 0x02ul:
      return true;
    default:
      return true;
    }
  }
#endif
  return false;
#endif
}

/**
 * Errata: USBD might not reach its active state.
 */
static bool chyu_nrf52_errata_171(void)
{
#ifndef NRF52_SERIES
  return false;
#else
#if defined(NRF52840_XXAA) || defined(DEVELOP_IN_NRF52840)
  uint32_t var1 = *(uint32_t *)0x10000130ul;
  uint32_t var2 = *(uint32_t *)0x10000134ul;
#endif
#if defined(NRF52840_XXAA) || defined(DEVELOP_IN_NRF52840)
  if (var1 == 0x08)
  {
    switch (var2)
    {
    case 0x00ul:
      return true;
    case 0x01ul:
      return true;
    case 0x02ul:
      return true;
    case 0x03ul:
      return true;
    default:
      return true;
    }
  }
#endif
  return false;
#endif
}

/**
 * Errata: ISO double buffering not functional.
 */
static bool chyu_nrf52_errata_166(void)
{
#ifndef NRF52_SERIES
  return false;
#else
#if defined(NRF52840_XXAA) || defined(DEVELOP_IN_NRF52840)
  uint32_t var1 = *(uint32_t *)0x10000130ul;
  uint32_t var2 = *(uint32_t *)0x10000134ul;
#endif
#if defined(NRF52840_XXAA) || defined(DEVELOP_IN_NRF52840)
  if (var1 == 0x08)
  {
    switch (var2)
    {
    case 0x00ul:
      return true;
    case 0x01ul:
      return true;
    case 0x02ul:
      return true;
    case 0x03ul:
      return true;
    default:
      return true;
    }
  }
#endif
  return false;
#endif
}

#ifdef SOFTDEVICE_PRESENT

#include "nrf_mbr.h"
#include "nrf_sdm.h"
#include "nrf_soc.h"

#ifndef SD_MAGIC_NUMBER
#define SD_MAGIC_NUMBER 0x51B1E5DB
#endif

