RT-Thread/rt-thread/components/drivers/usb/cherryusb/port/nrf5x/usb_dc_nrf5x.c
static inline bool is_sd_existed(void)
{
  return *((uint32_t *)(SOFTDEVICE_INFO_STRUCT_ADDRESS + 4)) == SD_MAGIC_NUMBER;
}

/**
 * check if SD is existed and enabled
 */
static inline bool is_sd_enabled(void)
{
  if (!is_sd_existed())
    return false;

  uint8_t sd_en = false;
  (void)sd_softdevice_is_enabled(&sd_en);
  return sd_en;
}
#endif

static bool hfclk_running(void)
{
#ifdef SOFTDEVICE_PRESENT
  if (is_sd_enabled())
  {
    uint32_t is_running = 0;
    (void)sd_clock_hfclk_is_running(&is_running);
    return (is_running ? true : false);
  }
#endif

#if defined(CLOCK_HFCLKSTAT_SRC_Xtal) || defined(__NRFX_DOXYGEN__)
  return (NRF_CLOCK->HFCLKSTAT & (CLOCK_HFCLKSTAT_STATE_Msk | CLOCK_HFCLKSTAT_SRC_Msk)) ==
         (CLOCK_HFCLKSTAT_STATE_Msk | (CLOCK_HFCLKSTAT_SRC_Xtal << CLOCK_HFCLKSTAT_SRC_Pos));
#else
  return (NRF_CLOCK->HFCLKSTAT & (CLOCK_HFCLKSTAT_STATE_Msk | CLOCK_HFCLKSTAT_SRC_Msk)) ==
         (CLOCK_HFCLKSTAT_STATE_Msk | (CLOCK_HFCLKSTAT_SRC_HFXO << CLOCK_HFCLKSTAT_SRC_Pos));
#endif
}

enum
{
  NRF_CLOCK_EVENT_HFCLKSTARTED = offsetof(NRF_CLOCK_Type, EVENTS_HFCLKSTARTED), /*!< HFCLK oscillator started. */
};

enum
{
  NRF_CLOCK_TASK_HFCLKSTART = offsetof(NRF_CLOCK_Type, TASKS_HFCLKSTART), /*!< Start HFCLK clock source. */
  NRF_CLOCK_TASK_HFCLKSTOP = offsetof(NRF_CLOCK_Type, TASKS_HFCLKSTOP),   /*!< Stop HFCLK clock source. */
};

static void hfclk_enable(void)
{
  /*!< already running, nothing to do */
  if (hfclk_running())
    return;

#ifdef SOFTDEVICE_PRESENT
  if (is_sd_enabled())
  {
    (void)sd_clock_hfclk_request();
    return;
  }
#endif

  *((volatile uint32_t *)((uint8_t *)NRF_CLOCK + NRF_CLOCK_EVENT_HFCLKSTARTED)) = 0x0UL;
  volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)NRF_CLOCK + (uint32_t)NRF_CLOCK_EVENT_HFCLKSTARTED));
  (void)dummy;
  *((volatile uint32_t *)((uint8_t *)NRF_CLOCK + NRF_CLOCK_TASK_HFCLKSTART)) = 0x1UL;
}

static void hfclk_disable(void)
{
#ifdef SOFTDEVICE_PRESENT
  if (is_sd_enabled())
  {
    (void)sd_clock_hfclk_release();
    return;
  }
#endif

  *((volatile uint32_t *)((uint8_t *)NRF_CLOCK + NRF_CLOCK_TASK_HFCLKSTOP)) = 0x1UL;
}

/**
 * Power & Clock Peripheral on nRF5x to manage USB
 * USB Bus power is managed by Power module, there are 3 VBUS power events:
 * Detected, Ready, Removed. Upon these power events, This function will
 * enable ( or disable ) usb & hfclk peripheral, set the usb pin pull up
 * accordingly to the controller Startup/Standby Sequence in USBD 51.4 specs.
 * Therefore this function must be called to handle USB power event by
 * - nrfx_power_usbevt_init() : if Softdevice is not used or enabled
 * - SoftDevice SOC event : if SD is used and enabled
 */
void cherry_usb_hal_nrf_power_event(uint32_t event)
{
  enum
  {
    USB_EVT_DETECTED = 0,
    USB_EVT_REMOVED = 1,
    USB_EVT_READY = 2
  };

  switch (event)
  {
  case USB_EVT_DETECTED:
    if (!NRF_USBD->ENABLE)
    {
      /*!< Prepare for receiving READY event: disable interrupt since we will blocking wait */
      NRF_USBD->INTENCLR = USBD_INTEN_USBEVENT_Msk;
      NRF_USBD->EVENTCAUSE = USBD_EVENTCAUSE_READY_Msk;
      __ISB();
      __DSB();

#ifdef NRF52_SERIES /*!< NRF53 does not need this errata */
      /*!< ERRATA 171, 187, 166 */
      if (chyu_nrf52_errata_187())
      {
        if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
          *((volatile uint32_t *)(0x4006ED14)) = 0x00000003;
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
        else
        {
          *((volatile uint32_t *)(0x4006ED14)) = 0x00000003;
        }
      }

      if (chyu_nrf52_errata_171())
      {
        if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
          *((volatile uint32_t *)(0x4006EC14)) = 0x000000C0;
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
        else
        {
          *((volatile uint32_t *)(0x4006EC14)) = 0x000000C0;
        }
      }
#endif

      /*!< Enable the peripheral (will cause Ready event) */
      NRF_USBD->ENABLE = 1;
      __ISB();
      __DSB();

      /*!< Enable HFCLK */
      hfclk_enable();
    }
    break;

  case USB_EVT_READY:
    /**
     * Skip if pull-up is enabled and HCLK is already running.
     * Application probably call this more than necessary.
     */
    if (NRF_USBD->USBPULLUP && hfclk_running())
      break;

    /*!< Waiting for USBD peripheral enabled */
    while (!(USBD_EVENTCAUSE_READY_Msk & NRF_USBD->EVENTCAUSE))
    {
    }

    NRF_USBD->EVENTCAUSE = USBD_EVENTCAUSE_READY_Msk;
    __ISB();
    __DSB();

#ifdef NRF52_SERIES
    if (chyu_nrf52_errata_171())
    {
      if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
      {
        *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
        *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
      }
      else
      {
        *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
      }
    }

    if (chyu_nrf52_errata_187())
    {
      if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
      {
        *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        *((volatile uint32_t *)(0x4006ED14)) = 0x00000000;
        *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
      }
      else
      {
        *((volatile uint32_t *)(0x4006ED14)) = 0x00000000;
      }
    }

    if (chyu_nrf52_errata_166())
    {
      *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7E3;
      *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = 0x40;

      __ISB();
      __DSB();
    }
#endif

    /*!< ISO buffer Lower half for IN, upper half for OUT */
    NRF_USBD->ISOSPLIT = USBD_ISOSPLIT_SPLIT_HalfIN;

    /*!< Enable bus-reset interrupt */
    NRF_USBD->INTENSET = USBD_INTEN_USBRESET_Msk;

    /*!< Enable interrupt, priorities should be set by application */
    /*!< clear pending irq */
    NVIC->ICPR[(((uint32_t)USBD_IRQn) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)USBD_IRQn) & 0x1FUL));
    /**
     * Don't enable USBD interrupt yet, if dcd_init() did not finish yet
     * Interrupt will be enabled by tud_init(), when USB stack is ready
     * to handle interrupts.
     */
    /*!< Wait for HFCLK */
    while (!hfclk_running())
    {
    }

    /*!< Enable pull up */
    NRF_USBD->USBPULLUP = 1;
    __ISB();
    __DSB();
    break;

  case USB_EVT_REMOVED:
    if (NRF_USBD->ENABLE)
    {
      /*!< Disable pull up */
      NRF_USBD->USBPULLUP = 0;
      __ISB();
      __DSB();

      /*!< Disable Interrupt */
      NVIC->ICER[(((uint32_t)USBD_IRQn) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)USBD_IRQn) & 0x1FUL));
      __DSB();
      __ISB();
      /*!< disable all interrupt */
      NRF_USBD->INTENCLR = NRF_USBD->INTEN;

      NRF_USBD->ENABLE = 0;
      __ISB();
      __DSB();
      hfclk_disable();
    }
    break;

  default:
    break;
  }
}